ArtilleryTestReports.txt
PS D:\Projects> artillery run flashsaleTest.yml
Test run id: t8cqz_xzbx9mf9b8tcztem6kwb9qmbjn7zk_8bpc
Phase started: The Flash Sale Spike (index: 0, duration: 10s) 01:28:06(+0530)

--------------------------------------
Metrics for period to: 01:28:10(+0530) (width: 3.145s)
--------------------------------------

http.codes.200: ................................................................ 152
http.downloaded_bytes: ......................................................... 11912
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 152
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 119
  mean: ........................................................................ 15.6
  median: ...................................................................... 10.9
  p95: ......................................................................... 36.2
  p99: ......................................................................... 92.8
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 119
  mean: ........................................................................ 15.6
  median: ...................................................................... 10.9
  p95: ......................................................................... 36.2
  p99: ......................................................................... 92.8
http.responses: ................................................................ 152
vusers.completed: .............................................................. 152
vusers.created: ................................................................ 152
vusers.created_by_name.Customer Checkout: ...................................... 152
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.8
  max: ......................................................................... 161.5
  mean: ........................................................................ 27.6
  median: ...................................................................... 21.1
  p95: ......................................................................... 63.4
  p99: ......................................................................... 102.5


Phase completed: The Flash Sale Spike (index: 0, duration: 10s) 01:28:16(+0530)

--------------------------------------
Metrics for period to: 01:28:20(+0530) (width: 7.067s)
--------------------------------------

http.codes.200: ................................................................ 348
http.downloaded_bytes: ......................................................... 27492
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 348
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 28
  mean: ........................................................................ 4.5
  median: ...................................................................... 4
  p95: ......................................................................... 10.1
  p99: ......................................................................... 13.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 28
  mean: ........................................................................ 4.5
  median: ...................................................................... 4
  p95: ......................................................................... 10.1
  p99: ......................................................................... 13.1
http.responses: ................................................................ 348
vusers.completed: .............................................................. 348
vusers.created: ................................................................ 348
vusers.created_by_name.Customer Checkout: ...................................... 348
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.8
  max: ......................................................................... 147.7
  mean: ........................................................................ 8.8
  median: ...................................................................... 7
  p95: ......................................................................... 17.6
  p99: ......................................................................... 32.1


All VUs finished. Total time: 12 seconds

--------------------------------
Summary report @ 01:28:19(+0530)
--------------------------------

http.codes.200: ................................................................ 500
http.downloaded_bytes: ......................................................... 39404
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 119
  mean: ........................................................................ 7.8
  median: ...................................................................... 4
  p95: ......................................................................... 25.8
  p99: ......................................................................... 40
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 119
  mean: ........................................................................ 7.8
  median: ...................................................................... 4
  p95: ......................................................................... 25.8
  p99: ......................................................................... 40
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Customer Checkout: ...................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.8
  max: ......................................................................... 161.5
  mean: ........................................................................ 14.5
  median: ...................................................................... 8.2
  p95: ......................................................................... 42.5
  p99: ......................................................................... 76
PS D:\Projects> artillery run flashsaleTest.yml
Test run id: tat5m_rydcejr6qbgz9amqbt3mcykczzcz7_xnwb
Phase started: The 1000 User Tsunami (index: 0, duration: 10s) 02:07:03(+0530)

Phase completed: The 1000 User Tsunami (index: 0, duration: 10s) 02:07:13(+0530)

--------------------------------------
Metrics for period to: 02:07:10(+0530) (width: 6.001s)
--------------------------------------

http.codes.200: ................................................................ 587
http.downloaded_bytes: ......................................................... 46513
http.request_rate: ............................................................. 100/sec
http.requests: ................................................................. 589
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 76
  mean: ........................................................................ 6.4
  median: ...................................................................... 4
  p95: ......................................................................... 16.9
  p99: ......................................................................... 34.8
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 76
  mean: ........................................................................ 6.4
  median: ...................................................................... 4
  p95: ......................................................................... 16.9
  p99: ......................................................................... 34.8
http.responses: ................................................................ 587
vusers.completed: .............................................................. 587
vusers.created: ................................................................ 589
vusers.created_by_name.Customer Checkout: ...................................... 589
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 165.3
  mean: ........................................................................ 16.8
  median: ...................................................................... 11.6
  p95: ......................................................................... 41.7
  p99: ......................................................................... 76


--------------------------------------
Metrics for period to: 02:07:20(+0530) (width: 4.268s)
--------------------------------------

http.codes.200: ................................................................ 413
http.downloaded_bytes: ......................................................... 33040
http.request_rate: ............................................................. 100/sec
http.requests: ................................................................. 411
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 40
  mean: ........................................................................ 4.9
  median: ...................................................................... 3
  p95: ......................................................................... 12.1
  p99: ......................................................................... 22.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 40
  mean: ........................................................................ 4.9
  median: ...................................................................... 3
  p95: ......................................................................... 12.1
  p99: ......................................................................... 22.9
http.responses: ................................................................ 413
vusers.completed: .............................................................. 413
vusers.created: ................................................................ 411
vusers.created_by_name.Customer Checkout: ...................................... 411
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.5
  max: ......................................................................... 165.7
  mean: ........................................................................ 14.5
  median: ...................................................................... 10.5
  p95: ......................................................................... 36.2
  p99: ......................................................................... 67.4


All VUs finished. Total time: 12 seconds

--------------------------------
Summary report @ 02:07:16(+0530)
--------------------------------

http.codes.200: ................................................................ 1000
http.downloaded_bytes: ......................................................... 79553
http.request_rate: ............................................................. 100/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 76
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 13.9
  p99: ......................................................................... 34.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 76
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 13.9
  p99: ......................................................................... 34.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 1000
vusers.created: ................................................................ 1000
vusers.created_by_name.Customer Checkout: ...................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 165.7
  mean: ........................................................................ 15.8
  median: ...................................................................... 11.1
  p95: ......................................................................... 41.7
  p99: ......................................................................... 74.4
PS D:\Projects> artillery run flashsaleTest.yml
Test run id: t5zcc_xbhqqp93wwdy6j8jnnae49eb5hgc9_8x5y
Phase started: The 1000 User Tsunami (index: 0, duration: 10s) 02:22:17(+0530)

--------------------------------------
Metrics for period to: 02:22:20(+0530) (width: 2.208s)
--------------------------------------

http.codes.200: ................................................................ 200
http.downloaded_bytes: ......................................................... 15692
http.request_rate: ............................................................. 104/sec
http.requests: ................................................................. 204
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 731
  mean: ........................................................................ 115.4
  median: ...................................................................... 22
  p95: ......................................................................... 459.5
  p99: ......................................................................... 608
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 731
  mean: ........................................................................ 115.4
  median: ...................................................................... 22
  p95: ......................................................................... 459.5
  p99: ......................................................................... 608
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 205
vusers.created_by_name.Customer Checkout: ...................................... 205
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.1
  max: ......................................................................... 749.2
  mean: ........................................................................ 137.6
  median: ...................................................................... 38.5
  p95: ......................................................................... 487.9
  p99: ......................................................................... 632.8


Phase completed: The 1000 User Tsunami (index: 0, duration: 10s) 02:22:27(+0530)

--------------------------------------
Metrics for period to: 02:22:30(+0530) (width: 8.061s)
--------------------------------------

http.codes.200: ................................................................ 800
http.downloaded_bytes: ......................................................... 63201
http.request_rate: ............................................................. 100/sec
http.requests: ................................................................. 796
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 87
  mean: ........................................................................ 9.1
  median: ...................................................................... 6
  p95: ......................................................................... 23.8
  p99: ......................................................................... 48.9
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 87
  mean: ........................................................................ 9.1
  median: ...................................................................... 6
  p95: ......................................................................... 23.8
  p99: ......................................................................... 48.9
http.responses: ................................................................ 800
vusers.completed: .............................................................. 800
vusers.created: ................................................................ 795
vusers.created_by_name.Customer Checkout: ...................................... 795
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5.4
  max: ......................................................................... 157.2
  mean: ........................................................................ 21.4
  median: ...................................................................... 16.3
  p95: ......................................................................... 49.9
  p99: ......................................................................... 85.6


All VUs finished. Total time: 13 seconds

--------------------------------
Summary report @ 02:22:30(+0530)
--------------------------------

http.codes.200: ................................................................ 1000
http.downloaded_bytes: ......................................................... 78893
http.request_rate: ............................................................. 104/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 731
  mean: ........................................................................ 30.4
  median: ...................................................................... 7.9
  p95: ......................................................................... 153
  p99: ......................................................................... 459.5
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 731
  mean: ........................................................................ 30.4
  median: ...................................................................... 7.9
  p95: ......................................................................... 153
  p99: ......................................................................... 459.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 1000
vusers.created: ................................................................ 1000
vusers.created_by_name.Customer Checkout: ...................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5.4
  max: ......................................................................... 749.2
  mean: ........................................................................ 44.7
  median: ...................................................................... 18.4
  p95: ......................................................................... 223.7
  p99: ......................................................................... 487.9